rottenpotatoes/app/controllers/movies_controller.rb

  def find_with_same_director
    @movie = Movie.find(params[:id])
    # Find director of current movie
    @current_movie_director = @movie.director
    if @current_movie_director.nil? or @current_movie_director.empty?
      # If current movie has no director, flash warning and redirect to movies index page
      flash[:warning] = "'#{@movie.title}' has no director info."
      redirect_to movies_path
    else
      # Else find all movies with the current movie director
      @movies_to_render = @movie.find_all_by_director
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'Zack Synder '